Поиск_вакансий_Сервер/src/Documents/Отклики/Отклики.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Отклики</name>
  <posting>Deny</posting>
  <registerRecords>InformationRegister.ЗапланированныеВстречи</registerRecords>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>EnumRef.ПриоритетыОткликов</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧерезЧтоСвязались</name>
    <type>
      <types>EnumRef.КакВышлиНаМеня</types>
    </type>
  </attributes>
  <attributes>
    <name>Компания</name>
    <type>
      <types>CatalogRef.Работодатели</types>
    </type>
  </attributes>
  <attributes>
    <name>Вакансия</name>
    <type>
      <types>DocumentRef.Вакансии</types>
    </type>
  </attributes>
  <attributes>
    <name>Метро</name>
    <type>
      <types>CatalogRef.СтанцииМетро</types>
    </type>
  </attributes>
  <attributes>
    <name>ПочтаКомпании</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПочтаHR</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерТелефона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФИОКадровика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусОтклика</types>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаНаРезюме</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗарплатаВРезюме</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сфера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Франчайзи</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗарплатаОт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗарплатаДо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>URLСсылка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РезюмеМое</name>
    <type>
      <types>CatalogRef.МоиРезюме</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИВремяСобеседования</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СхемаПроездаВПисьме</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Document>

Поиск_вакансий_Сервер/src/Enums/СтатусОтклика/СтатусОтклика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусОтклика</name>
  <enumValues>
    <name>НовоеПриглашение</name>
  </enumValues>
  <enumValues>
    <name>Рассмотрение</name>
  </enumValues>
  <enumValues>
    <name>НазначеноСобеседование</name>
  </enumValues>
  <enumValues>
    <name>ЖдуРезультатовСобеседования</name>
  </enumValues>
  <enumValues>
    <name>Отклонил</name>
  </enumValues>
  <enumValues>
    <name>ГотовыВзять</name>
  </enumValues>
  <enumValues>
    <name>НеГотовыВзять</name>
  </enumValues>
</mdclass:Enum>

Поиск_вакансий_Сервер/src/Documents/Отклики/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Попытка
		Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
			Если ЗначениеЗаполнено(ЭтаФорма.Параметры.ВакансияИзЖурнала) Тогда
				ДанныеВакансии = ЭтаФорма.Параметры.ВакансияИзЖурнала;					
				Объект.Вакансия = ДанныеВакансии;
				Объект.Компания = ДанныеВакансии.Работодатель;
				Объект.Статус = Перечисления.СтатусОтклика.НовоеПриглашение;
				ЗаполнитьЗначенияСвойств(Объект,ДанныеВакансии);
				Объект.Дата = ТекущаяДата();
			КонецЕсли;	
		КонецЕсли;
	Исключение
	КонецПопытки;
КонецПроцедуры
